Autodesk.Revit.DB.DataExchangeMessageVerbosity
Predefined verbosity levels for DataExchangeLog
Since:
2016
Since:
2016

Autodesk.Revit.DB.DataExchangeMessageVerbosity.Verbose
All events are reported.

Autodesk.Revit.DB.DataExchangeMessageVerbosity.Default
Default verbosity. Warnings, errors, fatal errors are reported.

Autodesk.Revit.DB.DataExchangeMessageVerbosity.Minimal
Minimal verbosity. Only fatal errors are reported.